tiborsimon/embedded-tdd-headers/pic/8bit/pic16f916_tdd.h
#define SEG15COM2                     522
#define S15C2                         523
#define LCDDATA7_SEG15                524
#define LCDDATA9                      525
#define SEG0COM3                      526
#define LCDDATA9_SEG0                 527
#define S0C3                          528
#define SEG1COM3                      529
#define S1C3                          530
#define LCDDATA9_SEG1                 531
#define S2C3                          532
#define LCDDATA9_SEG2                 533
#define SEG2COM3                      534
#define SEG3COM3                      535
#define S3C3                          536
#define LCDDATA9_SEG3                 537
#define SEG4COM3                      538
#define LCDDATA9_SEG4                 539
#define S4C3                          540
#define S5C3                          541
#define SEG5COM3                      542
#define LCDDATA9_SEG5                 543
#define SEG6COM3                      544
#define S6C3                          545
#define LCDDATA9_SEG6                 546
#define SEG7COM3                      547
#define S7C3                          548
#define LCDDATA9_SEG7                 549
#define LCDDATA10                     550
#define S8C3                          551
#define SEG8COM3                      552
#define LCDDATA10_SEG8                553
#define S9C3                          554
#define SEG9COM3                      555
#define LCDDATA10_SEG9                556
#define SEG10COM3                     557
#define S10C3                         558
#define LCDDATA10_SEG10               559
#define S11C3                         560
#define LCDDATA10_SEG11               561
#define SEG11COM3                     562
#define S12C3                         563
#define LCDDATA10_SEG12               564
#define SEG12COM3                     565
#define S13C3                         566
#define SEG13COM3                     567
#define LCDDATA10_SEG13               568
#define S14C3                         569
#define SEG14COM3                     570
#define LCDDATA10_SEG14               571
#define SEG15COM3                     572
#define S15C3                         573
#define LCDDATA10_SEG15               574
#define LCDSE0                        575
#define LCDSE0_SEG0                   576
#define SE0                           577
#define SEGEN0                        578
#define LCDSE0_SEG1                   579
#define SE1                           580
#define SEGEN1                        581
#define LCDSE0_SEG2                   582
#define SE2                           583
#define SEGEN2                        584
#define LCDSE0_SEG3                   585
#define SE3                           586
#define SEGEN3                        587
#define LCDSE0_SEG4                   588
#define SE4                           589
#define SEGEN4                        590
#define LCDSE0_SEG5                   591
#define SE5                           592
#define SEGEN5                        593
#define LCDSE0_SEG6                   594
#define SE6                           595
#define SEGEN6                        596
#define LCDSE0_SEG7                   597
#define SE7                           598
#define SEGEN7                        599
#define LCDSE1                        600
#define LCDSE1_SEG8                   601
#define SE8                           602
#define SEGEN8                        603
#define LCDSE1_SEG9                   604
#define SE9                           605
#define SEGEN9                        606
#define SEGEN10                       607
#define LCDSE1_SEG10                  608
#define SE10                          609
#define SEGEN11                       610
#define SE11                          611
#define LCDSE1_SEG11                  612
#define SEGEN12                       613
#define SE12                          614
#define LCDSE1_SEG12                  615
#define SEGEN13                       616
#define SE13                          617
#define LCDSE1_SEG13                  618
#define SE14                          619
#define SEGEN14                       620
#define LCDSE1_SEG14                  621
#define SE15                          622
#define SEGEN15                       623
#define LCDSE1_SEG15                  624
#define EECON1                        625
#define EERD                          626
#define RD                            627
#define EEWR                          628
#define WR                            629
#define WREN                          630
#define WRERR                         631
#define EEPGD                         632

#endif // _PIC16F916_H_
